export const branchList = [
  {
    id: '1646107782054432769',
    name: '服装城支行',
    address: '福建省泉州市石狮市服装城百灵街13-19号',
    latitude: '24.73376',
    longitude: '118.616623'
  },
  {
    id: '1619888859132489729',
    name: '仑峰分理处',
    latitude: '24.731748',
    longitude: '118.627341',
    address: '福建省泉州市石狮市八七路1772号'
  },
  {
    id: '1619888862815088642',
    name: '塔前分理处',
    latitude: '24.743974',
    longitude: '118.624414',
    address: '福建省泉州市石狮市灵秀镇茂厦村宝岛路848-852号'
  },
  {
    id: '1646107787536388098',
    name: '港塘支行',
    latitude: '24.750453',
    longitude: '118.616046',
    address: '福建省泉州市石狮市西环路与香江路交叉口东北40米'
  }
]
