export const occupations = [
  {
    text: '党的机关、国家机关、群众团体和社会组织、企事业单位负责人',
    value: '党的机关、国家机关、群众团体和社会组织、企事业单位负责人',
    children: [
      {
        text: '中国共产党机关负责人',
        value: '中国共产党机关负责人',
        children: [{ text: '中国共产党机关负责人', value: '中国共产党机关负责人' }]
      },
      {
        text: '国家机关负责人',
        value: '国家机关负责人',
        children: [
          { text: '国家权力机关负责人', value: '国家权力机关负责人' },
          { text: '国家行政机关负责人', value: '国家行政机关负责人' },
          { text: '人民政协机关负责人', value: '人民政协机关负责人' },
          { text: '人民法院和人民检察院负责人', value: '人民法院和人民检察院负责人' }
        ]
      },
      {
        text: '民主党派和工商联负责人',
        value: '民主党派和工商联负责人',
        children: [{ text: '民主党派和工商联负责人', value: '民主党派和工商联负责人' }]
      },
      {
        text: '人民团体和群众团体、社会组织及其他成员组织负责人',
        value: '人民团体和群众团体、社会组织及其他成员组织负责人',
        children: [
          { text: '人民团体和群众团体负责人', value: '人民团体和群众团体负责人' },
          { text: '社会团体负责人', value: '社会团体负责人' },
          { text: '民办非企业单位负责人', value: '民办非企业单位负责人' },
          { text: '社会中介组织负责人', value: '社会中介组织负责人' },
          { text: '基金会负责人', value: '基金会负责人' },
          { text: '宗教组织负责人', value: '宗教组织负责人' }
        ]
      },
      {
        text: '基层群众自治组织负责人',
        value: '基层群众自治组织负责人',
        children: [{ text: '基层群众自治组织负责人', value: '基层群众自治组织负责人' }]
      },
      {
        text: '企事业单位负责人',
        value: '企事业单位负责人',
        children: [
          { text: '人民团体和群众团体负责人', value: '人民团体和群众团体负责人' },
          { text: '社会团体负责人', value: '社会团体负责人' }
        ]
      }
    ]
  },
  {
    text: '专业技术人员',
    value: '专业技术人员',
    children: [
      {
        text: '其他专业技术人员',
        value: '其他专业技术人员',
        children: [{ text: '其他专业技术人员', value: '其他专业技术人员' }]
      },
      {
        text: '新闻出版、文化专业人员',
        value: '新闻出版、文化专业人员',
        children: [
          { text: '其他新闻出版、文化专业人员', value: '其他新闻出版、文化专业人员' },
          { text: '考古及文物保护专业人员', value: '考古及文物保护专业人员' },
          { text: '档案专业人员', value: '档案专业人员' },
          { text: '图书资料与微缩摄影专业人员', value: '图书资料与微缩摄影专业人员' },
          { text: '翻译人员', value: '翻译人员' },
          { text: '播音员及节目主持人', value: '播音员及节目主持人' },
          { text: '校对员', value: '校对员' },
          { text: '编辑', value: '编辑' },
          { text: '记者', value: '记者' }
        ]
      },
      {
        text: '文学艺术、体育专业人员',
        value: '文学艺术、体育专业人员',
        children: [
          { text: '其他文学艺术、体育专业人员', value: '其他文学艺术、体育专业人员' },
          { text: '体育专业人员', value: '体育专业人员' },
          { text: '工艺美术与创意设计专业人员', value: '工艺美术与创意设计专业人员' },
          { text: '美术专业人员', value: '美术专业人员' },
          { text: '舞台专业人员', value: '舞台专业人员' },
          { text: '电影电视制作专业人员', value: '电影电视制作专业人员' },
          { text: '音乐指挥与演员', value: '音乐指挥与演员' },
          { text: '文学创作与编导人员', value: '文学创作与编导人员' }
        ]
      },
      {
        text: '教学人员',
        value: '教学人员',
        children: [
          { text: '其他教学人员', value: '其他教学人员' },
          { text: '特殊教育教师', value: '特殊教育教师' },
          { text: '幼儿教育教师', value: '幼儿教育教师' },
          { text: '中小学教育教师', value: '中小学教育教师' },
          { text: '中等职业教育教师', value: '中等职业教育教师' },
          { text: '高等教育教师', value: '高等教育教师' }
        ]
      },
      {
        text: '法律、社会和宗教专业人员',
        value: '法律、社会和宗教专业人员',
        children: [
          { text: '其他法律、社会和宗教专业人员', value: '其他法律、社会和宗教专业人员' },
          { text: '社会工作专业人员', value: '社会工作专业人员' },
          { text: '宗教教职人员', value: '宗教教职人员' },
          { text: '法律顾问', value: '法律顾问' },
          { text: '审判辅助人员', value: '审判辅助人员' },
          { text: '司法鉴定人员', value: '司法鉴定人员' },
          { text: '公证员', value: '公证员' },
          { text: '律师', value: '律师' },
          { text: '检察官', value: '检察官' },
          { text: '法官', value: '法官' }
        ]
      },
      {
        text: '经济和金融专业人员',
        value: '经济和金融专业人员',
        children: [
          { text: '其他经济和金融专业人员', value: '其他经济和金融专业人员' },
          { text: '知识产权专业人员', value: '知识产权专业人员' },
          { text: '证券专业人员', value: '证券专业人员' },
          { text: '保险专业人员', value: '保险专业人员' },
          { text: '银行专业人员', value: '银行专业人员' },
          { text: '人力资源专业人员', value: '人力资源专业人员' },
          { text: '商务专业人员', value: '商务专业人员' },
          { text: '评估专业人员', value: '评估专业人员' },
          { text: '税务专业人员', value: '税务专业人员' },
          { text: '审计专业人员', value: '审计专业人员' },
          { text: '会计专业人员', value: '会计专业人员' },
          { text: '统计专业人员', value: '统计专业人员' },
          { text: '经济专业人员', value: '经济专业人员' }
        ]
      },
      {
        text: '卫生专业技术人员',
        value: '卫生专业技术人员',
        children: [
          { text: '其他卫生专业技术人员', value: '其他卫生专业技术人员' },
          { text: '乡村医生', value: '乡村医生' },
          { text: '护理人员', value: '护理人员' },
          { text: '医疗卫生技术人员', value: '医疗卫生技术人员' },
          { text: '药学技术人员', value: '药学技术人员' },
          { text: '公共卫生与健康医师', value: '公共卫生与健康医师' },
          { text: '民族医医师', value: '民族医医师' },
          { text: '中西医结合医师', value: '中西医结合医师' },
          { text: '中医医师', value: '中医医师' },
          { text: '西医医师', value: '西医医师' }
        ]
      },
      {
        text: '飞机和船舶技术人员',
        value: '飞机和船舶技术人员',
        children: [
          { text: '其他飞机和船舶技术人员', value: '其他飞机和船舶技术人员' },
          { text: '船舶指挥和引航人员', value: '船舶指挥和引航人员' },
          { text: '飞行人员和领航人员', value: '飞行人员和领航人员' }
        ]
      },
      {
        text: '农业技术人员',
        value: '农业技术人员',
        children: [
          { text: '其他农业技术人员', value: '其他农业技术人员' },
          { text: '农业工程技术人员', value: '农业工程技术人员' },
          { text: '水产技术人员', value: '水产技术人员' },
          { text: '畜牧与草业技术人员', value: '畜牧与草业技术人员' },
          { text: '兽医兽药技术人员', value: '兽医兽药技术人员' },
          { text: '作物遗传育种栽培技术人员', value: '作物遗传育种栽培技术人员' },
          { text: '园艺技术人员', value: '园艺技术人员' },
          { text: '植物保护技术人员', value: '植物保护技术人员' },
          { text: '农业技术指导人员', value: '农业技术指导人员' },
          { text: '土壤肥料技术人员', value: '土壤肥料技术人员' }
        ]
      },
      {
        text: '工程技术人员',
        value: '工程技术人员',
        children: [
          { text: '其他工程技术人员', value: '其他工程技术人员' },
          { text: '航天工程技术人员', value: '航天工程技术人员' },
          { text: '兵器工程技术人员', value: '兵器工程技术人员' },
          { text: '土地整治工程技术人员', value: '土地整治工程技术人员' },
          { text: '轻工工程技术人员', value: '轻工工程技术人员' },
          { text: '康复辅具工程技术人员', value: '康复辅具工程技术人员' },
          { text: '工业（产品）设计工程技术人员', value: '工业（产品）设计工程技术人员' },
          { text: '印刷复制工程技术人员', value: '印刷复制工程技术人员' },
          { text: '制药工程技术人员', value: '制药工程技术人员' },
          { text: '检验检疫工程技术人员', value: '检验检疫工程技术人员' },
          { text: '管理（工业）工程技术人员', value: '管理（工业）工程技术人员' },
          {
            text: '标准化、计量、质量和认证认可工程技术人员',
            value: '标准化、计量、质量和认证认可工程技术人员'
          },
          { text: '安全工程技术人员', value: '安全工程技术人员' },
          { text: '环境保护工程技术人员', value: '环境保护工程技术人员' },
          { text: '地震工程技术人员', value: '地震工程技术人员' },
          { text: '气象工程技术人员', value: '气象工程技术人员' },
          { text: '食品工程技术人员', value: '食品工程技术人员' },
          { text: '纺织服装工程技术人员', value: '纺织服装工程技术人员' },
          { text: '海洋工程技术人员', value: '海洋工程技术人员' },
          { text: '水利工程技术人员', value: '水利工程技术人员' },
          { text: '林业工程技术人员', value: '林业工程技术人员' },
          { text: '建材工程技术人员', value: '建材工程技术人员' },
          { text: '建筑工程技术人员', value: '建筑工程技术人员' },
          { text: '铁道工程技术人员', value: '铁道工程技术人员' },
          { text: '民用航空工程技术人员', value: '民用航空工程技术人员' },
          { text: '道路和水上运输工程技术人员', value: '道路和水上运输工程技术人员' },
          {
            text: '广播电影电视及演艺设备工程技术人员',
            value: '广播电影电视及演艺设备工程技术人员'
          },
          { text: '邮政和快递工程技术人员', value: '邮政和快递工程技术人员' },
          { text: '电力工程技术人员', value: '电力工程技术人员' },
          { text: '电气工程技术人员', value: '电气工程技术人员' },
          { text: '信息和通信工程技术人员', value: '信息和通信工程技术人员' },
          { text: '电子工程技术人员', value: '电子工程技术人员' },
          { text: '航空工程技术人员', value: '航空工程技术人员' },
          { text: '机械工程技术人员', value: '机械工程技术人员' },
          { text: '化工工程技术人员', value: '化工工程技术人员' },
          { text: '冶金工程技术人员', value: '冶金工程技术人员' },
          { text: '石油天然气工程技术人员', value: '石油天然气工程技术人员' },
          { text: '矿山工程技术人员', value: '矿山工程技术人员' },
          { text: '测绘和地理信息工程技术人员', value: '测绘和地理信息工程技术人员' },
          { text: '地质勘探工程技术人员', value: '地质勘探工程技术人员' }
        ]
      },
      {
        text: '科学研究人员',
        value: '科学研究人员',
        children: [
          { text: '其他科学研究人员', value: '其他科学研究人员' },
          { text: '艺术学研究人员', value: '艺术学研究人员' },
          { text: '工学研究人员', value: '工学研究人员' },
          { text: '理学研究人员', value: '理学研究人员' },
          { text: '文学研究人员', value: '文学研究人员' },
          { text: '军事学研究人员', value: '军事学研究人员' },
          { text: '管理学研究人员', value: '管理学研究人员' },
          { text: '医学研究人员', value: '医学研究人员' },
          { text: '农学研究人员', value: '农学研究人员' },
          { text: '历史学研究人员', value: '历史学研究人员' },
          { text: '教育学研究人员', value: '教育学研究人员' },
          { text: '法学研究人员', value: '法学研究人员' },
          { text: '经济学研究人员', value: '经济学研究人员' },
          { text: '哲学研究人员', value: '哲学研究人员' }
        ]
      }
    ]
  },
  {
    text: '办事人员和有关人员',
    value: '办事人员和有关人员',
    children: [
      {
        text: '其他办事人员和有关人员',
        value: '其他办事人员和有关人员',
        children: [
          { text: '其他办事人员', value: '其他办事人员' },
          { text: '行政执法和仲裁人员', value: '行政执法和仲裁人员' },
          { text: '行政事务处理人员', value: '行政事务处理人员' },
          { text: '行政业务办理人员', value: '行政业务办理人员' }
        ]
      },
      {
        text: '安全和消防人员',
        value: '安全和消防人员',
        children: [
          { text: '其他安全和消防人员', value: '其他安全和消防人员' },
          { text: '消防和应急救援人员', value: '消防和应急救援人员' },
          { text: '保卫人员', value: '保卫人员' },
          { text: '人民警察', value: '人民警察' }
        ]
      },
      { text: '办事人员', value: '办事人员', children: [{ text: '办事人员', value: '办事人员' }] }
    ]
  },
  {
    text: '社会生产服务和生活服务人员',
    value: '社会生产服务和生活服务人员',
    children: [
      {
        text: '其他社会生产和生活服务人员',
        value: '其他社会生产和生活服务人员',
        children: [{ text: '其他社会生产和生活服务人员', value: '其他社会生产和生活服务人员' }]
      },
      {
        text: '健康服务人员',
        value: '健康服务人员',
        children: [
          { text: '其他健康服务人员', value: '其他健康服务人员' },
          { text: '公共卫生辅助服务人员', value: '公共卫生辅助服务人员' },
          { text: '健康矫正服务人员', value: '健康矫正服务人员' },
          { text: '健康咨询服务人员', value: '健康咨询服务人员' },
          { text: '医疗辅助服务人员', value: '医疗辅助服务人员' }
        ]
      },
      {
        text: '文化、体育和娱乐服务人员',
        value: '文化、体育和娱乐服务人员',
        children: [
          { text: '其他文化、体育和娱乐服务人员', value: '其他文化、体育和娱乐服务人员' },
          { text: '文化、娱乐、体育经纪代理人员', value: '文化、娱乐、体育经纪代理人员' },
          { text: '健身和娱乐场所服务人员', value: '健身和娱乐场所服务人员' },
          { text: '文物保护作业人员', value: '文物保护作业人员' },
          {
            text: '广播、电视、电影和影视录音制作人员',
            value: '广播、电视、电影和影视录音制作人员'
          },
          { text: '群众文化活动服务人员', value: '群众文化活动服务人员' }
        ]
      },
      {
        text: '修理及制作服务人员',
        value: '修理及制作服务人员',
        children: [
          { text: '其他修理及制作服务人员', value: '其他修理及制作服务人员' },
          { text: '印章制作人员', value: '印章制作人员' },
          { text: '乐器维修人员', value: '乐器维修人员' },
          { text: '日用产品修理服务人员', value: '日用产品修理服务人员' },
          { text: '家用电子电器产品维修人员', value: '家用电子电器产品维修人员' },
          { text: '计算机和办公设备维修人员', value: '计算机和办公设备维修人员' },
          { text: '汽车摩托车修理技术服务人员', value: '汽车摩托车修理技术服务人员' }
        ]
      },
      {
        text: '电力、燃气及水供应服务人员',
        value: '电力、燃气及水供应服务人员',
        children: [
          { text: '其他电力、燃气及水供应服务人员', value: '其他电力、燃气及水供应服务人员' },
          { text: '水供应服务人员', value: '水供应服务人员' },
          { text: '燃气供应服务人员', value: '燃气供应服务人员' },
          { text: '电力供应服务人员', value: '电力供应服务人员' }
        ]
      },
      {
        text: '居民服务人员',
        value: '居民服务人员',
        children: [
          { text: '其他居民服务人员', value: '其他居民服务人员' },
          { text: '宠物服务人员', value: '宠物服务人员' },
          { text: '殡葬服务人员', value: '殡葬服务人员' },
          { text: '婚姻服务人员', value: '婚姻服务人员' },
          { text: '保健服务人员', value: '保健服务人员' },
          { text: '美容美发和浴池服务人员', value: '美容美发和浴池服务人员' },
          { text: '服装裁剪和洗染织补人员', value: '服装裁剪和洗染织补人员' },
          { text: '生活照料服务人员', value: '生活照料服务人员' }
        ]
      },
      {
        text: '水利、环境和公共设施管理服务人员',
        value: '水利、环境和公共设施管理服务人员',
        children: [
          {
            text: '其他水利、环境和公共设施管理服务人员',
            value: '其他水利、环境和公共设施管理服务人员'
          },
          { text: '绿化与园艺服务人员', value: '绿化与园艺服务人员' },
          { text: '有害生物防制人员', value: '有害生物防制人员' },
          { text: '环境卫生服务人员', value: '环境卫生服务人员' },
          { text: '环境治理服务人员', value: '环境治理服务人员' },
          { text: '野生动植物保护人员', value: '野生动植物保护人员' },
          { text: '自然保护区和草地监护人员', value: '自然保护区和草地监护人员' },
          { text: '农田灌排人员', value: '农田灌排人员' },
          { text: '水土保持人员', value: '水土保持人员' },
          { text: '水文服务人员', value: '水文服务人员' },
          { text: '水利设施管养人员', value: '水利设施管养人员' }
        ]
      },
      {
        text: '技术辅助服务人员',
        value: '技术辅助服务人员',
        children: [
          { text: '其他技术辅助服务人员', value: '其他技术辅助服务人员' },
          { text: '摄影扩印服务人员', value: '摄影扩印服务人员' },
          { text: '专业化设计服务人员', value: '专业化设计服务人员' },
          { text: '地质勘查人员', value: '地质勘查人员' },
          { text: '环境监测服务人员', value: '环境监测服务人员' },
          { text: '检验、检测和计量服务人员', value: '检验、检测和计量服务人员' },
          { text: '地理信息服务人员', value: '地理信息服务人员' },
          { text: '测绘服务人员', value: '测绘服务人员' },
          { text: '海洋服务人员', value: '海洋服务人员' },
          { text: '气象服务人员', value: '气象服务人员' }
        ]
      },
      {
        text: '租赁和商务服务人员',
        value: '租赁和商务服务人员',
        children: [
          { text: '其他租赁和商务服务人员', value: '其他租赁和商务服务人员' },
          { text: '会议及展览服务人员', value: '会议及展览服务人员' },
          { text: '市场管理服务人员', value: '市场管理服务人员' },
          { text: '安全保护服务人员', value: '安全保护服务人员' },
          { text: '旅游及公共游览场所服务人员', value: '旅游及公共游览场所服务人员' },
          { text: '人力资源服务人员', value: '人力资源服务人员' },
          { text: '商务咨询服务人员', value: '商务咨询服务人员' },
          { text: '租赁业务人员', value: '租赁业务人员' }
        ]
      },
      {
        text: '房地产服务人员',
        value: '房地产服务人员',
        children: [
          { text: '其他房地产服务人员', value: '其他房地产服务人员' },
          { text: '房地产中介服务人员', value: '房地产中介服务人员' },
          { text: '物业管理服务人员', value: '物业管理服务人员' }
        ]
      },
      {
        text: '金融服务人员',
        value: '金融服务人员',
        children: [
          { text: '其他金融服务人员', value: '其他金融服务人员' },
          { text: '信托服务人员', value: '信托服务人员' },
          { text: '典当服务人员', value: '典当服务人员' },
          { text: '保险服务人员', value: '保险服务人员' },
          { text: '期货服务人员', value: '期货服务人员' },
          { text: '证券服务人员', value: '证券服务人员' },
          { text: '银行服务人员', value: '银行服务人员' }
        ]
      },
      {
        text: '信息传输、软件和信息技术服务人员',
        value: '信息传输、软件和信息技术服务人员',
        children: [
          {
            text: '其他信息传输、软件和信息技术服务人员',
            value: '其他信息传输、软件和信息技术服务人员'
          },
          { text: '软件和信息技术服务人员', value: '软件和信息技术服务人员' },
          { text: '信息通信网络运行管理人员', value: '信息通信网络运行管理人员' },
          { text: '广播电视传输服务人员', value: '广播电视传输服务人员' },
          { text: '信息通信网络维护人员', value: '信息通信网络维护人员' },
          { text: '信息通信业务人员', value: '信息通信业务人员' }
        ]
      },
      {
        text: '住宿和餐饮服务人员',
        value: '住宿和餐饮服务人员',
        children: [
          { text: '其他住宿和餐饮服务人员', value: '其他住宿和餐饮服务人员' },
          { text: '餐饮服务人员', value: '餐饮服务人员' },
          { text: '住宿服务人员', value: '住宿服务人员' }
        ]
      },
      {
        text: '交通运输、仓储和邮政业服务人员',
        value: '交通运输、仓储和邮政业服务人员',
        children: [
          {
            text: '其他交通运输、仓储和邮政业服务人员',
            value: '其他交通运输、仓储和邮政业服务人员'
          },
          { text: '邮政和快递服务人员', value: '邮政和快递服务人员' },
          { text: '仓储人员', value: '仓储人员' },
          { text: '装卸搬运和运输代理服务人员', value: '装卸搬运和运输代理服务人员' },
          { text: '航空运输服务人员', value: '航空运输服务人员' },
          { text: '水上运输服务人员', value: '水上运输服务人员' },
          { text: '道路运输服务人员', value: '道路运输服务人员' },
          { text: '轨道交通运输服务人员', value: '轨道交通运输服务人员' }
        ]
      },
      {
        text: '批发与零售服务人员',
        value: '批发与零售服务人员',
        children: [
          { text: '其他批发与零售服务人员', value: '其他批发与零售服务人员' },
          { text: '特殊商品购销人员', value: '特殊商品购销人员' },
          { text: '再生物资回收人员', value: '再生物资回收人员' },
          { text: '贸易经济代理人员', value: '贸易经济代理人员' },
          { text: '销售人员', value: '销售人员' },
          { text: '采购人员', value: '采购人员' }
        ]
      }
    ]
  },
  {
    text: '农、林、牧、渔业生产及辅助人员',
    value: '农、林、牧、渔业生产及辅助人员',
    children: [
      {
        text: '其他农、林、牧、渔业生产及辅助人员',
        value: '其他农、林、牧、渔业生产及辅助人员',
        children: [
          {
            text: '其他农、林、牧、渔业生产及辅助人员',
            value: '其他农、林、牧、渔业生产及辅助人员'
          }
        ]
      },
      {
        text: '农林牧渔生产辅助人员',
        value: '农林牧渔生产辅助人员',
        children: [
          { text: '其他农林牧渔生产辅助人员', value: '其他农林牧渔生产辅助人员' },
          { text: '农副林特产品初加工人员', value: '农副林特产品初加工人员' },
          { text: '农机化服务人员', value: '农机化服务人员' },
          { text: '农村环境保护人员', value: '农村环境保护人员' },
          { text: '农村能源利用人员', value: '农村能源利用人员' },
          { text: '动植物疫病防治人员', value: '动植物疫病防治人员' },
          { text: '农业生产服务人员', value: '农业生产服务人员' }
        ]
      },
      {
        text: '渔业生产人员',
        value: '渔业生产人员',
        children: [
          { text: '其他渔业生产人员', value: '其他渔业生产人员' },
          { text: '水产捕捞及有关人员', value: '水产捕捞及有关人员' },
          { text: '水产养殖人员', value: '水产养殖人员' },
          { text: '水产育苗繁育人员', value: '水产育苗繁育人员' }
        ]
      },
      {
        text: '畜牧业生产人员',
        value: '畜牧业生产人员',
        children: [
          { text: '其他畜牧业生产人员', value: '其他畜牧业生产人员' },
          { text: '特种经济动物饲养人员', value: '特种经济动物饲养人员' },
          { text: '畜禽饲养人员', value: '畜禽饲养人员' },
          { text: '畜禽种苗繁育人员', value: '畜禽种苗繁育人员' }
        ]
      },
      {
        text: '林业生产人员',
        value: '林业生产人员',
        children: [
          { text: '其他林业生产人员', value: '其他林业生产人员' },
          { text: '木材采运人员', value: '木材采运人员' },
          { text: '森林经营和管护人员', value: '森林经营和管护人员' },
          { text: '营造林人员', value: '营造林人员' },
          { text: '林木种苗繁育人员', value: '林木种苗繁育人员' }
        ]
      },
      {
        text: '农业生产人员',
        value: '农业生产人员',
        children: [
          { text: '其他农业生产人员', value: '其他农业生产人员' },
          { text: '农作物生产人员', value: '农作物生产人员' },
          { text: '作物种子（苗）繁育生产人员', value: '作物种子（苗）繁育生产人员' }
        ]
      }
    ]
  },
  {
    text: '生产制造及有关人员',
    value: '生产制造及有关人员',
    children: [
      {
        text: '其他生产制造及有关人员',
        value: '其他生产制造及有关人员',
        children: [{ text: '其他生产制造及有关人员', value: '其他生产制造及有关人员' }]
      },
      {
        text: '生产辅助人员',
        value: '生产辅助人员',
        children: [
          { text: '其他生产辅助人员', value: '其他生产辅助人员' },
          { text: '安全生产管理人员', value: '安全生产管理人员' },
          { text: '包装人员', value: '包装人员' },
          { text: '称重计量人员', value: '称重计量人员' },
          { text: '检验试验人员', value: '检验试验人员' },
          { text: '船舶、民用航空器修理人员', value: '船舶、民用航空器修理人员' },
          { text: '机械设备修理人员', value: '机械设备修理人员' }
        ]
      },
      {
        text: '运输设备和通用工程机械操作人员及有关人员',
        value: '运输设备和通用工程机械操作人员及有关人员',
        children: [
          {
            text: '其他运输设备和通用工程机械操作人员及有关人员',
            value: '其他运输设备和通用工程机械操作人员及有关人员'
          },
          { text: '通用工程机械操作人员', value: '通用工程机械操作人员' },
          { text: '水上运输设备操作及有关人员', value: '水上运输设备操作及有关人员' },
          { text: '民用航空设备操作及有关人员', value: '民用航空设备操作及有关人员' },
          { text: '轨道交通运输机械设备操作人员', value: '轨道交通运输机械设备操作人员' },
          { text: '专用车辆操作人员', value: '专用车辆操作人员' }
        ]
      },
      {
        text: '建筑施工人员',
        value: '建筑施工人员',
        children: [
          { text: '其他建筑施工人员', value: '其他建筑施工人员' },
          { text: '古建筑修建人员', value: '古建筑修建人员' },
          { text: '建筑装饰人员', value: '建筑装饰人员' },
          { text: '建筑安装施工人员', value: '建筑安装施工人员' },
          { text: '土木工程建筑施工人员', value: '土木工程建筑施工人员' },
          { text: '房屋建筑施工人员', value: '房屋建筑施工人员' }
        ]
      },
      {
        text: '电力、热力、气体、水生产和输配人员',
        value: '电力、热力、气体、水生产和输配人员',
        children: [
          {
            text: '其他电力、热力、气体、水生产和输配人员',
            value: '其他电力、热力、气体、水生产和输配人员'
          },
          { text: '水生产、输排和水处理人员', value: '水生产、输排和水处理人员' },
          { text: '气体生产、处理和输送人员', value: '气体生产、处理和输送人员' },
          { text: '电力、热力生产和供应人员', value: '电力、热力生产和供应人员' }
        ]
      },
      {
        text: '废弃资源综合利用人员',
        value: '废弃资源综合利用人员',
        children: [
          { text: '其他废弃资源综合利用人员', value: '其他废弃资源综合利用人员' },
          { text: '废料和碎屑加工处理人员', value: '废料和碎屑加工处理人员' }
        ]
      },
      {
        text: '仪器仪表制造人员',
        value: '仪器仪表制造人员',
        children: [
          { text: '其他仪器仪表制造人员', value: '其他仪器仪表制造人员' },
          { text: '仪器仪表装配人员', value: '仪器仪表装配人员' }
        ]
      },
      {
        text: '计算机、通信和其他电子设备制造人员',
        value: '计算机、通信和其他电子设备制造人员',
        children: [
          {
            text: '其他计算机、通信和其他电子设备制造人员',
            value: '其他计算机、通信和其他电子设备制造人员'
          },
          { text: '电子设备装配调试人员', value: '电子设备装配调试人员' },
          { text: '计算机制造人员', value: '计算机制造人员' },
          { text: '电子器件制造人员', value: '电子器件制造人员' },
          { text: '电子元件制造人员', value: '电子元件制造人员' }
        ]
      },
      {
        text: '电气机械和器材制造人员',
        value: '电气机械和器材制造人员',
        children: [
          { text: '其他电气机械和器材制造人员', value: '其他电气机械和器材制造人员' },
          { text: '电气信号设备装置制造人员', value: '电气信号设备装置制造人员' },
          { text: '照明器具制造人员', value: '照明器具制造人员' },
          { text: '非电力家用器具制造人员', value: '非电力家用器具制造人员' },
          { text: '家用电力器具制造人员', value: '家用电力器具制造人员' },
          { text: '电池制造人员', value: '电池制造人员' },
          {
            text: '点线电缆、光纤光缆及电工器械制造人员',
            value: '点线电缆、光纤光缆及电工器械制造人员'
          },
          { text: '输配电及控制设备制造人员', value: '输配电及控制设备制造人员' },
          { text: '电机制造人员', value: '电机制造人员' }
        ]
      },
      {
        text: '铁路、船舶、航空设备制造人员',
        value: '铁路、船舶、航空设备制造人员',
        children: [
          { text: '其他铁路、船舶、航空设备制造人员', value: '其他铁路、船舶、航空设备制造人员' },
          { text: '摩托车、自行车制造人员', value: '摩托车、自行车制造人员' },
          { text: '航空产品装配、调试人员', value: '航空产品装配、调试人员' },
          { text: '船舶制造人员', value: '船舶制造人员' },
          { text: '铁道交通运输设备制造人员', value: '铁道交通运输设备制造人员' }
        ]
      },
      {
        text: '汽车制造人员',
        value: '汽车制造人员',
        children: [
          { text: '其他汽车制造人员', value: '其他汽车制造人员' },
          { text: '汽车整车制造人员', value: '汽车整车制造人员' },
          { text: '汽车零部件、饰品生产加工人员', value: '汽车零部件、饰品生产加工人员' }
        ]
      },
      {
        text: '专用设备制造人员',
        value: '专用设备制造人员',
        children: [
          { text: '其他专用设备制造人员', value: '其他专用设备制造人员' },
          { text: '医疗器械制品和康复辅具生产人员', value: '医疗器械制品和康复辅具生产人员' },
          { text: '农业机械制造人员', value: '农业机械制造人员' },
          { text: '电子专用设备装配调试人员', value: '电子专用设备装配调试人员' },
          {
            text: '纺织服装和皮革加工专用设备制造人员',
            value: '纺织服装和皮革加工专用设备制造人员'
          },
          { text: '印刷生产专用设备制造人员', value: '印刷生产专用设备制造人员' },
          { text: '采矿、建筑专用设备制造人员', value: '采矿、建筑专用设备制造人员' }
        ]
      },
      {
        text: '通用设备制造人员',
        value: '通用设备制造人员',
        children: [
          { text: '其他通用设备制造人员', value: '其他通用设备制造人员' },
          { text: '文化办公机械制造人员', value: '文化办公机械制造人员' },
          { text: '锅炉、水处理、衡器等设备制造人员', value: '锅炉、水处理、衡器等设备制造人员' },
          {
            text: '泵、压缩机、阀门及类似机械制造人员',
            value: '泵、压缩机、阀门及类似机械制造人员'
          },
          { text: '物料搬运设备制造人员', value: '物料搬运设备制造人员' },
          { text: '金属加工机械制造人员', value: '金属加工机械制造人员' },
          { text: '锅炉及原动设备制造人员', value: '锅炉及原动设备制造人员' },
          { text: '通用基础件装配制造人员', value: '通用基础件装配制造人员' }
        ]
      },
      {
        text: '金属制品制造人员',
        value: '金属制品制造人员',
        children: [
          { text: '其他金属制品制造人员', value: '其他金属制品制造人员' },
          { text: '五金制品制作装配人员', value: '五金制品制作装配人员' }
        ]
      },
      {
        text: '机械制造基础加工人员',
        value: '机械制造基础加工人员',
        children: [
          { text: '其他机械制造基础加工人员', value: '其他机械制造基础加工人员' },
          { text: '工装工具制造加工人员', value: '工装工具制造加工人员' },
          { text: '机械表面处理加工人员', value: '机械表面处理加工人员' },
          { text: '机械热加工人员', value: '机械热加工人员' },
          { text: '机械冷加工人员', value: '机械冷加工人员' }
        ]
      },
      {
        text: '金属冶炼和压延加工人员',
        value: '金属冶炼和压延加工人员',
        children: [
          { text: '其他金属冶炼和压延加工人员', value: '其他金属冶炼和压延加工人员' },
          { text: '硬质合金生产人员', value: '硬质合金生产人员' },
          { text: '金属轧制人员', value: '金属轧制人员' },
          { text: '半导体材料制备人员', value: '半导体材料制备人员' },
          { text: '稀贵金属冶炼人员', value: '稀贵金属冶炼人员' },
          { text: '轻有色金属冶炼人员', value: '轻有色金属冶炼人员' },
          { text: '重有色金属冶炼人员', value: '重有色金属冶炼人员' },
          { text: '铁合金冶炼人员', value: '铁合金冶炼人员' },
          { text: '铸铁管人员', value: '铸铁管人员' },
          { text: '炼钢人员', value: '炼钢人员' },
          { text: '炼铁人员', value: '炼铁人员' }
        ]
      },
      {
        text: '采矿人员',
        value: '采矿人员',
        children: [
          { text: '其他采矿人员', value: '其他采矿人员' },
          { text: '采盐人员', value: '采盐人员' },
          { text: '石油和天然气开采与储运人员', value: '石油和天然气开采与储运人员' },
          { text: '矿物采选人员', value: '矿物采选人员' }
        ]
      },
      {
        text: '非金属矿物制品制造人员',
        value: '非金属矿物制品制造人员',
        children: [
          { text: '其他非金属矿物制品制造人员', value: '其他非金属矿物制品制造人员' },
          {
            text: '高岭土、珍珠岩等非金属矿物加工人员',
            value: '高岭土、珍珠岩等非金属矿物加工人员'
          },
          { text: '石墨及碳素制品生产人员', value: '石墨及碳素制品生产人员' },
          { text: '耐火材料制品生产人员', value: '耐火材料制品生产人员' },
          { text: '陶瓷制品制造人员', value: '陶瓷制品制造人员' },
          {
            text: '玻璃纤维及玻璃纤维增强塑料制品制造人员',
            value: '玻璃纤维及玻璃纤维增强塑料制品制造人员'
          },
          { text: '玻璃及玻璃制品生产加工人员', value: '玻璃及玻璃制品生产加工人员' },
          { text: '砖瓦石材等建筑材料制造人员', value: '砖瓦石材等建筑材料制造人员' },
          { text: '水泥、石灰、石膏及其制品制造人员', value: '水泥、石灰、石膏及其制品制造人员' }
        ]
      },
      {
        text: '橡胶和塑料制品制造人员',
        value: '橡胶和塑料制品制造人员',
        children: [
          { text: '其他橡胶和塑料制品制造人员', value: '其他橡胶和塑料制品制造人员' },
          { text: '塑料制品加工人员', value: '塑料制品加工人员' },
          { text: '橡胶制品生产人员', value: '橡胶制品生产人员' }
        ]
      },
      {
        text: '化学纤维制造人员',
        value: '化学纤维制造人员',
        children: [
          { text: '其他橡胶和塑料制品制造人员', value: '其他橡胶和塑料制品制造人员' },
          { text: '塑料制品加工人员', value: '塑料制品加工人员' },
          { text: '橡胶制品生产人员', value: '橡胶制品生产人员' },
          { text: '', value: '' },
          { text: '其他化学纤维制造人员', value: '其他化学纤维制造人员' },
          { text: '化学纤维纺丝及后处理人员', value: '化学纤维纺丝及后处理人员' },
          { text: '化学纤维原料制造人员', value: '化学纤维原料制造人员' }
        ]
      },
      {
        text: '医药制造人员',
        value: '医药制造人员',
        children: [
          { text: '其他药品制造人员', value: '其他药品制造人员' },
          { text: '生物药品制造人员', value: '生物药品制造人员' },
          { text: '兽用药品制造人员', value: '兽用药品制造人员' },
          { text: '药物制剂人员', value: '药物制剂人员' },
          { text: '中药饮片加工人员', value: '中药饮片加工人员' },
          { text: '化学药品原料药制造人员', value: '化学药品原料药制造人员' }
        ]
      },
      {
        text: '化学原料和化学制品制造人员',
        value: '化学原料和化学制品制造人员',
        children: [
          { text: '其他化学原料和化学制品制造人员', value: '其他化学原料和化学制品制造人员' },
          { text: '日用化学品生产人员', value: '日用化学品生产人员' },
          {
            text: '火化工制造、保管、爆破及焰火产品制造人员',
            value: '火化工制造、保管、爆破及焰火产品制造人员'
          },
          { text: '专用化学产品生产人员', value: '专用化学产品生产人员' },
          { text: '合成橡胶生产人员', value: '合成橡胶生产人员' },
          { text: '合成树脂生产人员', value: '合成树脂生产人员' },
          {
            text: '涂料、油墨、颜料及类似产品制造人员',
            value: '涂料、油墨、颜料及类似产品制造人员'
          },
          { text: '农药生产人员', value: '农药生产人员' },
          { text: '化学肥料生产人员', value: '化学肥料生产人员' },
          { text: '基础化学原料制造人员', value: '基础化学原料制造人员' },
          { text: '化工产品生产通用工艺人员', value: '化工产品生产通用工艺人员' }
        ]
      },
      {
        text: '石油加工和炼焦、煤化工生产人员',
        value: '石油加工和炼焦、煤化工生产人员',
        children: [
          {
            text: '其他石油加工和炼焦、煤化工生产人员',
            value: '其他石油加工和炼焦、煤化工生产人员'
          },
          { text: '煤化工生产人员', value: '煤化工生产人员' },
          { text: '炼焦人员', value: '炼焦人员' },
          { text: '石油炼制生产人员', value: '石油炼制生产人员' }
        ]
      },
      {
        text: '文教、工美、体育和娱乐用品制作人员',
        value: '文教、工美、体育和娱乐用品制作人员',
        children: [
          {
            text: '其他文教、工美、体育和娱乐用品制作人员',
            value: '其他文教、工美、体育和娱乐用品制作人员'
          },
          { text: '玩具制作人员', value: '玩具制作人员' },
          { text: '体育用品制作人员', value: '体育用品制作人员' },
          { text: '工艺美术品制作人员', value: '工艺美术品制作人员' },
          { text: '乐器制作人员', value: '乐器制作人员' },
          { text: '文教用品制作人员', value: '文教用品制作人员' }
        ]
      },
      {
        text: '印刷和记录媒介复制人员',
        value: '印刷和记录媒介复制人员',
        children: [
          { text: '其他印刷和记录媒介复制人员', value: '其他印刷和记录媒介复制人员' },
          { text: '记录媒介复制人员', value: '记录媒介复制人员' },
          { text: '印刷人员', value: '印刷人员' }
        ]
      },
      {
        text: '纸及纸制品生产加工人员',
        value: '纸及纸制品生产加工人员',
        children: [
          { text: '其他纸及纸制品生产加工人员', value: '其他纸及纸制品生产加工人员' },
          { text: '纸制品制作人员', value: '纸制品制作人员' },
          { text: '制浆造纸人员', value: '制浆造纸人员' }
        ]
      },
      {
        text: '木材加工、家具与木制品制作人员',
        value: '木材加工、家具与木制品制作人员',
        children: [
          {
            text: '其他木材加工、家具与木制品制作人员',
            value: '其他木材加工、家具与木制品制作人员'
          },
          { text: '家具制造人员', value: '家具制造人员' },
          { text: '木制品制造人员', value: '木制品制造人员' },
          { text: '人造板制造人员', value: '人造板制造人员' },
          { text: '木材加工人员', value: '木材加工人员' }
        ]
      },
      {
        text: '纺织品、服装和皮革、毛皮制品加工制作人员',
        value: '纺织品、服装和皮革、毛皮制品加工制作人员',
        children: [
          {
            text: '其他纺织品、服装和皮革、毛皮制品加工制作人员',
            value: '其他纺织品、服装和皮革、毛皮制品加工制作人员'
          },
          { text: '鞋帽制作人员', value: '鞋帽制作人员' },
          { text: '羽绒羽毛加工及制品制造人员', value: '羽绒羽毛加工及制品制造人员' },
          { text: '皮革、毛皮及其制品制造人员', value: '皮革、毛皮及其制品制造人员' },
          { text: '纺织品和服装剪裁缝纫人员', value: '纺织品和服装剪裁缝纫人员' }
        ]
      },
      {
        text: '纺织、针织、印染人员',
        value: '纺织、针织、印染人员',
        children: [
          { text: '其他纺织、针织、印染人员', value: '其他纺织、针织、印染人员' },
          { text: '印染人员', value: '印染人员' },
          { text: '非织造布制作人员', value: '非织造布制作人员' },
          { text: '针织人员', value: '针织人员' },
          { text: '织造人员', value: '织造人员' },
          { text: '纺纱人员', value: '纺纱人员' },
          { text: '纤维预处理人员', value: '纤维预处理人员' }
        ]
      },
      {
        text: '烟草及其制品加工人员',
        value: '烟草及其制品加工人员',
        children: [
          { text: '其他烟草及其制品加工人员', value: '其他烟草及其制品加工人员' },
          { text: '烟草制品生产人员', value: '烟草制品生产人员' },
          { text: '烟用材料生产人员', value: '烟用材料生产人员' },
          { text: '烟叶初加工人员', value: '烟叶初加工人员' }
        ]
      },
      {
        text: '食品、饮料生产加工人员',
        value: '食品、饮料生产加工人员',
        children: [
          { text: '其他食品、饮料产品加工人员', value: '其他食品、饮料产品加工人员' },
          { text: '酒、饮料及精制茶制造人员', value: '酒、饮料及精制茶制造人员' },
          { text: '调味品及食品添加剂制作人员', value: '调味品及食品添加剂制作人员' },
          { text: '乳制品加工人员', value: '乳制品加工人员' },
          { text: '方便食品和罐头食品加工人员', value: '方便食品和罐头食品加工人员' },
          { text: '糖制品加工人员', value: '糖制品加工人员' },
          { text: '焙烤食品制造人员', value: '焙烤食品制造人员' }
        ]
      },
      {
        text: '农副产品加工人员',
        value: '农副产品加工人员',
        children: [
          { text: '其他农副产品加工人员', value: '其他农副产品加工人员' },
          { text: '淀粉和豆制品加工人员', value: '淀粉和豆制品加工人员' },
          { text: '果蔬和坚果加工人员', value: '果蔬和坚果加工人员' },
          { text: '水产品加工人员', value: '水产品加工人员' },
          { text: '畜牧制品加工人员', value: '畜牧制品加工人员' },
          { text: '制糖人员', value: '制糖人员' },
          { text: '饲料加工人员', value: '饲料加工人员' },
          { text: '粮油加工人员', value: '粮油加工人员' }
        ]
      }
    ]
  },
  {
    text: '不便分类的其他从业人员',
    value: '不便分类的其他从业人员',
    children: [
      { text: '学生', value: '学生', children: [{ text: '学生', value: '学生' }] },
      { text: '未成年人', value: '未成年人', children: [{ text: '未成年人', value: '未成年人' }] },
      {
        text: '离退休人员',
        value: '离退休人员',
        children: [{ text: '离退休人员', value: '离退休人员' }]
      },
      {
        text: '自由职业者',
        value: '自由职业者',
        children: [{ text: '自由职业者', value: '自由职业者' }]
      },
      { text: '其他', value: '其他', children: [{ text: '其他', value: '其他' }] }
    ]
  },
  {
    text: '军人',
    value: '军人',
    children: [
      {
        text: '军人',
        value: '军人',
        children: [
          { text: { value: '军人', text: '军人' }, value: { value: '军人', text: '军人' } }
        ]
      }
    ]
  }
]
